<?php
// =    يعني بحط قيمة في متغير، زي لما أقول خُد الرقم ده واحتفظ بيه
// ==   يعني بقارن بين حاجتين في القيمة بس، حتى لو النوع مختلف (زي 5 و "5")
// ===  بقارن بين القيمة والنوع، يعني لازم الاتنين يكونوا نفس الحاجة بالظبط (يعني 5 رقم مش هو هو "5" نص)

$user_name ="Aboda Owais";// هنا خزنت الاسم في المتغير
$email = "ao@gmail.com"; // وهنا خزنت الإيميل في متغير تاني
// الشرط هنا بيقول: لو الاسم هو "Aboda Owais" أو الإيميل هو "ao@gmail.com"
if($user_name ==="Aboda Owais" || $email ==="ao@gmail.com"){
    echo "Welcom Admin"; // لو الشرط اتحقق، اطبع الرسالة دي
}
// (||) or , (&&) and , 
//  !== علامة التعحب جنبهم هنا علشان تنفي الشرط فبدل تساوي تبقي لا تساوي 
// || معناها "أو" - يعني يكفي شرط واحد يتحقق علشان الجملة تتنفذ
// && معناها "و" - يعني لازم الشرطين يتحققوا علشان الجملة تتنفذ
// !== معناها "لا يساوي" - يعني الشرط بيتحقق لو الحاجتين مش زي بعض
?>
